servicetester/TemplateRequest/CartAdd.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://webservices.amazon.com/AWSECommerceService/2013-08-01">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:CartAdd>
         <ns:MarketplaceDomain>{{ns:MarketplaceDomain}}</ns:MarketplaceDomain>
         <ns:AWSAccessKeyId>{{ns:AWSAccessKeyId}}</ns:AWSAccessKeyId>
         <ns:AssociateTag>{{ns:AssociateTag_1}}</ns:AssociateTag>
         <ns:Validate>{{ns:Validate}}</ns:Validate>
         <ns:XMLEscaping>{{ns:XMLEscaping}}</ns:XMLEscaping>
         <ns:Shared>
            <ns:CartId>{{ns:CartId_1}}</ns:CartId>
            <ns:HMAC>{{ns:HMAC_1}}</ns:HMAC>
            <ns:MergeCart>{{ns:MergeCart_1}}</ns:MergeCart>
            <ns:Items>
               <ns:Item>
                  <ns:ASIN>{{ns:ASIN_1}}</ns:ASIN>
                  <ns:OfferListingId>{{ns:OfferListingId_1}}</ns:OfferListingId>
                  <ns:Quantity>{{ns:Quantity_1}}</ns:Quantity>
                  <ns:AssociateTag>{{ns:AssociateTag_2}}</ns:AssociateTag>
                  <ns:ListItemId>{{ns:ListItemId_1}}</ns:ListItemId>
               </ns:Item>
            </ns:Items>
            <ns:ResponseGroup>{{ns:ResponseGroup_1}}</ns:ResponseGroup>
         </ns:Shared>
         <ns:Request>
            <ns:CartId>{{ns:CartId_2}}</ns:CartId>
            <ns:HMAC>{{ns:HMAC_2}}</ns:HMAC>
            <ns:MergeCart>{{ns:MergeCart_2}}</ns:MergeCart>
            <ns:Items>
               <ns:Item>
                  <ns:ASIN>{{ns:ASIN_2}}</ns:ASIN>
                  <ns:OfferListingId>{{ns:OfferListingId_2}}</ns:OfferListingId>
                  <ns:Quantity>{{ns:Quantity_2}}</ns:Quantity>
                  <ns:AssociateTag>{{ns:AssociateTag_3}}</ns:AssociateTag>
                  <ns:ListItemId>{{ns:ListItemId_2}}</ns:ListItemId>
               </ns:Item>
            </ns:Items>
            <ns:ResponseGroup>{{ns:ResponseGroup_2}}</ns:ResponseGroup>
         </ns:Request>
      </ns:CartAdd>
   </soapenv:Body>
</soapenv:Envelope>